app/views/teams/show.html.erb


<% @team.users.each do |user| %>
---
SELECT `users`.* FROM `users` WHERE `users`.`team_id` = 4

            <h3><%= user.name %></h3>
                <% user.parent_tasks.each do |parent_task| %>
---
SELECT `parent_tasks`.* FROM `parent_tasks` WHERE `parent_tasks`.`user_id` = 10