app/views/parent_tasks/index.html.erb

          <%= link_to "タスク詳細", parent_task_path(parent_task) %></br>
          <li>子たすくの数<%= parent_task.child_tasks.count %></li>
---
SELECT `child_tasks`.* FROM `child_tasks` WHERE `child_tasks`.`parent_task_id` = 12
SELECT COUNT(*) FROM `child_tasks` WHERE `child_tasks`.`parent_task_id` = 2