app/views/parent_tasks/index.html.erb

    <%= parent_task.id %>
    <% parent_task.task_comments.each do |com| %>
---
SELECT `task_comments`.* FROM `task_comments` WHERE `task_comments`.`parent_task_id` = 1