app/views/parent_tasks/show.html.erb

SELECT `child_tasks`.* FROM `child_tasks` WHERE `child_tasks`.`parent_task_id` = 2
---

 <ul><% @parent_task.child_tasks.each do |child_task| %>