app/views/child_tasks/index.html.erb

        <% end %>
        <% child_task.task_comments.each do |child_task_comment| %>
---
SELECT `task_comments`.* FROM `task_comments` WHERE `task_comments`.`child_task_id` = 18