app/views/users/show.html.erb

SELECT `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1
---
<div class="container">
  <div class="row">
    <div class="col-12 text-center border">
      <h3><%= current_user.name %></h3>
      <h3><%= current_user.team_id %></h3>
      <h3><%= Team.find(current_user.team_id]).name %></h3>