app/controllers/application_controller.rb

SELECT `teams`.* FROM `teams` INNER JOIN `organizations` ON `teams`.`id` = `organizations`.`team_id` WHERE `organizations`.`boss_id` = 2 ORDER BY `teams`.`id` ASC LIMIT 1
---
    def after_sign_in_path_for(resource)
      if user_signed_in?
        parent_tasks_path(resource)
      elsif boss_signed_in?
        @current_boss.teams.first