app/controllers/bosses_controller.rb

SELECT `bosses`.* FROM `bosses`
---
  def index
    @bosses = Boss.all

SELECT `bosses`.* FROM `bosses` WHERE `bosses`.`id` = 2 LIMIT 1
---
  def show
    @boss=Boss.find(current_boss.id)

SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`boss_id` = 2
SELECT `organizations`.* FROM `organizations` WHERE `organizations`.`boss_id` = 2 AND `organizations`.`team_id` = NULL LIMIT 1
INSERT INTO `organizations` (`created_at`, `updated_at`, `team_id`, `boss_id`) VALUES ('2020-08-25 23:08:27.108534', '2020-08-25 23:08:27.108534', 4, 2)
---
  def update
    # binding.pry
    current_boss.organizations.each do |organization|
      organization.destroy
    end

    # binding.pry
    params["boss"]["team_ids"].each do |t|
      if Organization.find_by(boss_id: current_boss.id, team_id: t)
        next
      else
        current_boss.organizations.create(team_id: t).save