app/controllers/child_tasks_controller.rb

    def index
       @child_tasks = ChildTask.where(parent_task_id: params[:parent_task_id]).order(child_deadline: "ASC")
       @parent_task = ParentTask.find_by(id: params[:parent_task_id])
       @task_comment = TaskComment.new
       @child_tasks.each do |child_task|
---
SELECT `parent_tasks`.* FROM `parent_tasks` WHERE `parent_tasks`.`id` = 12 LIMIT 1
SELECT `child_tasks`.* FROM `child_tasks` WHERE `child_tasks`.`id` = 1 LIMIT 1

    def show
       @child_task = ChildTask.find(params[:id])
---
SELECT `child_tasks`.* FROM `child_tasks` WHERE `child_tasks`.`id` = 1 LIMIT 1

    def new
        @parent_task = ParentTask.find(params[:parent_task_id])
---
SELECT `parent_tasks`.* FROM `parent_tasks` WHERE `parent_tasks`.`id` = 14 LIMIT 1

    def create
        @child_task = ChildTask.new(child_task_params)
        @child_task.parent_task_id = params[:parent_task_id].to_i
        if @child_task.save
---
INSERT INTO `child_tasks` (`title`, `child_deadline`, `possibility`, `explanation`, `parent_task_id`, `created_at`, `updated_at`) VALUES ('asdfasdfa', '2020-08-05 20:42:00', 0, 'asdfasdf', 14, '2020-08-25 11:42:16.808018', '2020-08-25 11:42:16.808018')

    def destroy
        @child_task = ChildTask.find(params[:id])
---
SELECT `child_tasks`.* FROM `child_tasks` WHERE `child_tasks`.`id` = 0 LIMIT 1

    def index_result_finish
        resulted
        if @child_task.save
---
UPDATE `child_tasks` SET `child_tasks`.`result` = 0, `child_tasks`.`updated_at` = '2020-08-25 11:45:01.447528' WHERE `child_tasks`.`id` = 20

    def show_result_finish
        resulted
        if @child_task.save
---
UPDATE `child_tasks` SET `child_tasks`.`done` = NULL, `child_tasks`.`updated_at` = '2020-08-24 11:48:40.826400' WHERE `child_tasks`.`id` = 5

    def canceled
        @child_task = ChildTask.find_by(id: params[:id])
        @child_task.done = nil
        @child_task.finish_time = nil
        @child_task.save
---
SELECT `child_tasks`.* FROM `child_tasks` WHERE `child_tasks`.`id` = 5 LIMIT 1  [["id", 5], ["LIMIT", 1]]
UPDATE `child_tasks` SET `child_tasks`.`finish_time` = '2020-08-24 11:48:43', `child_tasks`.`updated_at` = '2020-08-24 11:48:43.383278' WHERE `child_tasks`.`id` = 5

    def resulted
        @child_task = ChildTask.find_by(id: params[:id])
        parent_task = ParentTask.find(params[:parent_task_id])
---
SELECT `child_tasks`.* FROM `child_tasks` WHERE `child_tasks`.`id` = 20 LIMIT 1
SELECT `parent_tasks`.* FROM `parent_tasks` WHERE `parent_tasks`.`id` = 14 LIMIT 1  [["id", 14], ["LIMIT", 1]]

    def finished
        time = Time.now
        @child_task = ChildTask.find_by(id: params[:id])
        @child_task.finish_time = time
        add_hour = 10800
        if @child_task.save
            if @child_task.finish_time < @child_task.child_deadline
                @child_task.done = 0
                @child_task.save
            elsif @child_task.child_deadline + add_hour > @child_task.finish_time && @child_task.finish_time >= @child_task.child_deadline
                @child_task.done = 1
                @child_task.save
            elsif @child_task.finish_time >= @child_task.child_deadline + add_hour
                @child_task.done = 2
                @child_task.save
---
SELECT `child_tasks`.* FROM `child_tasks` WHERE `child_tasks`.`id` IS NULL LIMIT 1
UPDATE `child_tasks` SET `child_tasks`.`finish_time` = '2020-08-24 09:18:59', `child_tasks`.`updated_at` = '2020-08-24 09:18:59.069017' WHERE `child_tasks`.`id` = 4
UPDATE `child_tasks` SET `child_tasks`.`done` = 0, `child_tasks`.`updated_at` = '2020-08-24 09:19:10.228692' WHERE `child_tasks`.`id` = 4
UPDATE `child_tasks` SET `child_tasks`.`done` = 0, `child_tasks`.`updated_at` = '2020-08-24 09:13:22.402008' WHERE `child_tasks`.`id` = 4
UPDATE `child_tasks` SET `child_tasks`.`done` = 2, `child_tasks`.`updated_at` = '2020-08-24 11:09:01.241760' WHERE `child_tasks`.`id` = 16