app/controllers/child_tasks_controller.rb

SELECT `parent_tasks`.* FROM `parent_tasks` WHERE `parent_tasks`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
---
    def resulted
        @child_task = ChildTask.find_by(id: params[:id])
        parent_task = ParentTask.find(params[:parent_task_id])