app/controllers/parent_tasks_controller.rb

SELECT `parent_tasks`.* FROM `parent_tasks`
---
    def index
        @parent_tasks = ParentTask.all

SELECT `parent_tasks`.* FROM `parent_tasks` WHERE `parent_tasks`.`id` = 1 LIMIT 1
---
    def show
        @parent_task = ParentTask.find(params[:id])

INSERT INTO `parent_tasks` (`title`, `parent_deadline`, `self_evaluate`, `explanation`, `created_at`, `updated_at`, `user_id`) VALUES ('ゴリラ', '2020-08-31 15:33:00', 0, '動物観察', '2020-08-25 06:33:48.950451', '2020-08-25 06:33:48.950451', 2)
---
    def create
        @parent_task = ParentTask.new(parent_task_params)
        @parent_task.user_id = current_user.id
        # binding.pry
        if @parent_task.save