app/controllers/parent_tasks_controller.rb

    def index
        # @parent_tasks = current_user.parent_tasks
        @parent_tasks = current_user.parent_tasks.order(parent_deadline: "ASC")
---
SELECT `parent_tasks`.* FROM `parent_tasks` WHERE `parent_tasks`.`user_id` = 2 ORDER BY `parent_tasks`.`parent_deadline` ASC