app/controllers/task_comments_controller.rb

INSERT INTO `task_comments` (`parent_comment`, `user_id`, `parent_task_id`, `created_at`, `updated_at`) VALUES ('f', 8, 1, '2020-08-24 07:28:11.658022', '2020-08-24 07:28:11.658022')
---
    def create
        @task_comment = TaskComment.new(task_comment_params)
        @task_comment.user_id = current_user.id
        # binding.pry
        @task_comment.parent_task_id = params[:parent_task_id]

        if @task_comment.save