app/controllers/task_comments_controller.rb

    def create
        if user_signed_in? && (!ChildTask.find_by(id: params[:id]))
            user_parent_task_comments
            task_comment_save #parent_taskに対してSave
        elsif user_signed_in? && ChildTask.find_by(id: params[:id])
---
SELECT `child_tasks`.* FROM `child_tasks` WHERE `child_tasks`.`id` IS NULL LIMIT 1
SELECT `child_tasks`.* FROM `child_tasks` WHERE `child_tasks`.`id` = 5 LIMIT 1  [["id", 5], ["LIMIT", 1]]

    def update
        @task_comment = TaskComment.find(params[:id])
        parent_task = ParentTask.find(params[:parent_task_id])
---
SELECT `parent_tasks`.* FROM `parent_tasks` WHERE `parent_tasks`.`id` = 1 LIMIT 1

    def task_comment_save
        if @task_comment.save
---
INSERT INTO `task_comments` (`parent_comment`, `created_at`, `updated_at`, `user_id`, `parent_task_id`) VALUES ('d', '2020-08-25 11:21:25.875686', '2020-08-25 11:21:25.875686', 14, 20)

    def child_comment_save
        if @child_comment.save
---
INSERT INTO `task_comments` (`created_at`, `updated_at`, `child_task_id`, `user_id`, `child_comment`) VALUES ('2020-08-25 11:46:50.562805', '2020-08-25 11:46:50.562805', 5, 14, 'agagasd')