app/controllers/teams_controller.rb

SELECT `teams`.* FROM `teams` INNER JOIN `organizations` ON `teams`.`id` = `organizations`.`team_id` WHERE `organizations`.`boss_id` = 2
---
  def show
    current_boss.teams.each do |team|