app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @parent_tasks=ParentTask.where(user_id: @user.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `parent_tasks`.* FROM `parent_tasks` WHERE `parent_tasks`.`user_id` = 14