app/views/bosses/show.html.erb

    <div class="col-12 text-left border">
      <% @boss.teams.each do |team|%>
        <ul><%= team.name %>
          <% User.where(team_id: team.id).each do |user| %>
---
SELECT `teams`.* FROM `teams` INNER JOIN `organizations` ON `teams`.`id` = `organizations`.`team_id` WHERE `organizations`.`boss_id` = 2
SELECT `users`.* FROM `users` WHERE `users`.`team_id` = 4

        <%= form_for @boss, :url=> {controller: "bosses", action: "update"} do |f| %>
          <%= f.collection_check_boxes(:team_ids, Team.all, :id, :name) do |b| %>
---
SELECT `teams`.* FROM `teams`