app/views/layouts/_navbar.html.erb

        <% elsif boss_signed_in?%>
          <% current_boss.teams.each do |team|%>
---
SELECT `teams`.* FROM `teams` INNER JOIN `organizations` ON `teams`.`id` = `organizations`.`team_id` WHERE `organizations`.`boss_id` = 2