app/views/users/registrations/new.html.erb

SELECT `teams`.* FROM `teams`
---
  <%= f.label :team_id %>
  <%= f.collection_select :team_id, Team.all, :id, :name, :prompt => "チームを選択" %>